d = ['0000', '0001', '0010', '0011', '0100', '0101', '0110', '0111',
     '1000', '1001', '1010', '1011', '1100', '1101', '1110', '1111']
d2 = {'001101': 0, '010011': 1, '111011': 2, '110001': 3, '100011': 4, '110111': 5,
      '001011': 6, '111101': 7, '011001': 8, '101111': 9}
# T = int(input())
# for t in range(1, 11):
xN = '01D06079861D79F99F'
tmp = ''
# 숫자 48~57
# 문자 65~
for i in xN:
    if ord(i)< 60:
        tmp += d[ord(i)-48]
    else:
        tmp += d[ord(i)-55]

N = tmp


r = []
for i in range(0, len(N), 7):
    tmp = 0
    for j in range(7):
        if i+j < len(N):
            if N[i+j] == '1':
                tmp *= 2
                tmp += 1
            else:
                tmp *= 2
    r.append(str(tmp))
print(', '.join(r))